#include "SPI.h"


/**
 * @brief  SPI общего назначения
 */
void SPI1_Init(void)
{
}


/* -------------------------------------------------------------------------- */
/* ------------------------------- SPI4 ------------------------------------- */
/* -------------------------------------------------------------------------- */
/**
 * @brief  LoRa 1
 * CPOL = 0; CPHA = 0; Max speed 16 MHz. 
 * По умолчанию размер буфера 8 бит.
 */
void SPI4_Init(void)
{
    SPI_I2S_DeInit(SPI4);
    
    SPI_InitTypeDef init_struct;
    SPI_StructInit(&init_struct);
    // задать скорость
}


/**
 * @brief  функция для настройки нужного размера буфера
 * @param  size: задаёт размер буфера
 *              @arg 0: размер буфера 8 бит
 *              @arg 1: размер буфера 16 бит
 */
void SPI4_data_size_config(uint8_t size)
{
    if (size == 0)
        SPI_DataSizeConfig(SPI4, SPI_DataSize_8b);
    else
        SPI_DataSizeConfig(SPI4, SPI_DataSize_16b);
}

/* -------------------------------------------------------------------------- */
/* --------------------------- SPI4 end ------------------------------------- */
/* -------------------------------------------------------------------------- */